Appiko/nrf5x-firmware/application/rf_data_tx_rx/S2LP_Library/Inc/S2LP_Regs.h
#define MULTICAST_ADDR_DUAL_SYNC0_REGMASK			((uint8_t)0xFF)


/**
 * \brief PCKT_FLT_GOALS0 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 TX_SOURCE_ADDR: Tx packet source or RX packet destination field.
 * \endcode
 */
#define PCKT_FLT_GOALS0_ADDR			((uint8_t)0x45)

#define TX_SOURCE_ADDR_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS5 register
 * \code
 * Read and Write
 * Default value: 0x01
 * 7:0 RX_TIMER_CNTR: Counter for RX timer.
 * \endcode
 */
#define TIMERS5_ADDR			((uint8_t)0x46)

#define RX_TIMER_CNTR_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS4 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 RX_TIMER_PRESC: Prescaler for RX timer.
 * \endcode
 */
#define TIMERS4_ADDR			((uint8_t)0x47)

#define RX_TIMER_PRESC_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS3 register
 * \code
 * Read and Write
 * Default value: 0x01
 * 7:0 LDC_TIMER_PRESC: Prescaler for wake up timer.
 * \endcode
 */
#define TIMERS3_ADDR			((uint8_t)0x48)

#define LDC_TIMER_PRESC_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 LDC_TIMER_CNTR: Counter for wake up timer.
 * \endcode
 */
#define TIMERS2_ADDR			((uint8_t)0x49)

#define LDC_TIMER_CNTR_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS1 register
 * \code
 * Read and Write
 * Default value: 0x01
 * 7:0 LDC_RELOAD_PRSC: Prescaler value for reload operation of wake up timer.
 * \endcode
 */
#define TIMERS1_ADDR			((uint8_t)0x4A)

#define LDC_RELOAD_PRSC_REGMASK			((uint8_t)0xFF)


/**
 * \brief TIMERS0 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 LDC_RELOAD_CNTR: Counter value for reload operation of wake up timer.
 * \endcode
 */
#define TIMERS0_ADDR			((uint8_t)0x4B)

#define LDC_RELOAD_CNTR_REGMASK			((uint8_t)0xFF)


/**
 * \brief CSMA_CONF3 register
 * \code
 * Read and Write
 * Default value: 0x4C
 * 7:0 BU_CNTR_SEED[14:8]: MSB part of the seed for the random generator used to apply the CSMA algorithm.
 * \endcode
 */
#define CSMA_CONF3_ADDR			((uint8_t)0x4C)

#define BU_CNTR_SEED_14_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief CSMA_CONF2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 BU_CNTR_SEED[7:0]: LSB part of the seed for the random generator used to apply the CSMA algorithm.
 * \endcode
 */
#define CSMA_CONF2_ADDR			((uint8_t)0x4D)

#define BU_CNTR_SEED_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief CSMA_CONF1 register
 * \code
 * Read and Write
 * Default value: 0x04
 * 7:2 BU_PRSC: Prescaler value for the back-off unit BU.
 * 1:0 CCA_PERIOD: Multiplier for the Tcca timer.
 * \endcode
 */
#define CSMA_CONF1_ADDR			((uint8_t)0x4E)

#define BU_PRSC_REGMASK			((uint8_t)0xFC)
#define CCA_PERIOD_REGMASK			((uint8_t)0x03)


/**
 * \brief CSMA_CONF0 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:4 CCA_LEN: The number of time in which the listen operation is performed.
 * 3 RESERVED: -
 * 2:0 NBACKOFF_MAX: Max number of back-off cycles.
 * \endcode
 */
#define CSMA_CONF0_ADDR			((uint8_t)0x4F)

#define CCA_LEN_REGMASK			((uint8_t)0xF0)
#define NBACKOFF_MAX_REGMASK			((uint8_t)0x07)


/**
 * \brief IRQ_MASK3 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 INT_MASK[31:24]: Enable the routing of the interrupt flag on the configured IRQ GPIO.
 * \endcode
 */
#define IRQ_MASK3_ADDR			((uint8_t)0x50)

#define INT_MASK_31_24_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_MASK2 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 INT_MASK[23:16]: Enable the routing of the interrupt flag on the configured IRQ GPIO.
 * \endcode
 */
#define IRQ_MASK2_ADDR			((uint8_t)0x51)

#define INT_MASK_23_16_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_MASK1 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 INT_MASK[15:8]: Enable the routing of the interrupt flag on the configured IRQ GPIO.
 * \endcode
 */
#define IRQ_MASK1_ADDR			((uint8_t)0x52)

#define INT_MASK_15_8_REGMASK			((uint8_t)0xFF)


/**
 * \brief IRQ_MASK0 register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 INT_MASK[7:0]: Enable the routing of the interrupt flag on the configured IRQ GPIO.
 * \endcode
 */
#define IRQ_MASK0_ADDR			((uint8_t)0x53)

#define INT_MASK_7_0_REGMASK			((uint8_t)0xFF)


/**
 * \brief FAST_RX_TIMER register
 * \code
 * Read and Write
 * Default value: 0x00
 * 7:0 RSSI_SETTLING_LIMIT[7:0]: RSSI settling limit word. This determines the duration of the
 *                      FAST_RX_TERM timer.
 * \endcode
 */
#define FAST_RX_TIMER_ADDR			((uint8_t)0x54)

#define RSSI_SETTLING_LIMIT			((uint8_t)0xFF)


/**
 * \brief PA_POWER8 register
 * \code
 * Read and Write
 * Default value: 0x01
 * 7 RESERVED: -
 * 6:0 PA_LEVEL8: Output power level for 8th slot.
 * \endcode
 */
#define PA_POWER8_ADDR			((uint8_t)0x5A)

#define PA_LEVEL8_REGMASK			((uint8_t)0x7F)


/**
 * \brief PA_POWER7 register
 * \code
 * Read and Write
 * Default value: 0x0C
 * 7 RESERVED: -
 * 6:0 PA_LEVEL_7: Output power level for 7th slot.
 * \endcode
 */
#define PA_POWER7_ADDR			((uint8_t)0x5B)

#define PA_LEVEL_7_REGMASK			((uint8_t)0x7F)


/**
 * \brief PA_POWER6 register
 * \code
 * Read and Write
 * Default value: 0x18
 * 7 RESERVED: -
 * 6:0 PA_LEVEL_6: Output power level for 6th slot.
 * \endcode
 */
#define PA_POWER6_ADDR			((uint8_t)0x5C)

#define PA_LEVEL_6_REGMASK			((uint8_t)0x7F)


/**
 * \brief PA_POWER5 register
 * \code
 * Read and Write
 * Default value: 0x24
 * 7 RESERVED: -
 * 6:0 PA_LEVEL_5: Output power level for 5th slot.
 * \endcode
 */
#define PA_POWER5_ADDR			((uint8_t)0x5D)

#define PA_LEVEL_5_REGMASK			((uint8_t)0x7F)


/**
 * \brief PA_POWER4 register
 * \code
 * Read and Write
 * Default value: 0x30
 * 7 RESERVED: -
 * 6:0 PA_LEVEL_4: Output power level for 4th slot.
 * \endcode
 */
#define PA_POWER4_ADDR			((uint8_t)0x5E)

